Repository: RedTurtle/rt.purge
Catalog: src/rt/purge/locales/*/LC_MESSAGES/rt.purge.po
Languages: it

source: Caching proxies
it: Proxy di cache

source: Cancel
it: Annulla

source: Chaching not enabled. Please see the site configuration
it: Cache non abilitata. Prego controlla la configurazione del sito

source: Changes saved
it: Modifiche memorizzate

source: Domains
it: Domini

source: Edit cancelled
it: Modifiche annullate

source: Enable purging
it: Abilita purging

source: Friendly messages
it: Messaggi amichevoli

source: If disabled, no purging will take place
it: Se disabilitato, nessuna invalidazione verrà eseguita

source: Invalidate (purge) documents cached in Varnish
it: Invalida (purge) documenti nella cache di Varnish

source: Message verbosity level
it: Livello di dettaglio messaggi

source: No messages at all
it: Nessun messaggio

source: Provide the URLs of each proxy to which PURGE requests shoudl be sent.
it: Fornisci gli URL per ogni proxy ai quali le richieste di PURGE devono essere inviate.

source: Purge page
it: Invalida pagina

source: Purge settings
it: Impostazioni invalidazione cache

source: Save
it: Salva

source: Send PURGE requests with virtual hosting paths
it: Invia richieste di PURGE con virtual hosting paths

source: Verbose messages
it: Messaggi dettagliati

source: help_domains
it: Questa optione è rilevante solo se stai usando hosting e hai abilitato l'opzione di invare richieste di PURGE con i virtual hosting sopra. Se il tuo sito è servito su domini multipli, ad esempio http://example.org e http://www.example.org, potresti volere invalidare entrambi. Se così, inserisci tutti i domini qui.

source: help_rtpurge_settings_editform
it: Gestione della configurazione del sito di rt.purge

source: help_verbosity
it: Scegli il tuo livello di dettaglio dei messaggi. Con "messaggi amichevoli" (predefinito) verrà visualizato un messaggio positivo se almeno una pagina in cache verrà invalidata. Con "messaggi dettagliati" saranno visualizzati i dettagli per ogni operazione di invalidazione. Usa "nessun messaggio" se non vuoi stampare nulla relativamente alle operazioni di invalidazione.

source: help_virtualHosting
it: Questa opzione è rilevante solo se stati usando virtual hosting con VirtualHostMonster di Zope Questo richiede speciali token (VirtualHostBase e VirtualHostRoot) nell'URL per avvertire Zope riguardo i tipi di URL che l'utente vede. Se gli URL di virtual host sono in uso e questa opzione è impostata, le richieste di PURGE saranno invate al proxy di cache con i token di virtual hosting. Questo ha senso se c'è un web server davanti al tuo sistema di cache che esegue le regole di rewrite necessarie a tradurre un URL utente in un URL di virtual hosting, così che la richiesta che il proxy vede abbia le informazioni di rewrite. Conversely, if the rewrite is done in or behind the caching proxy, you want to disable this option, so that the PURGE requests use URLs that match those seen by the caching proxy as they come from the client.

source: purging_error
it: Errore nell'invalidare "${url}". Status (${status})

source: purging_friendly_error
it: Impossibile invalidare "${url}".

source: url_purged
it: ${url} invalidato.
